_Rarzrabotki/Kazna/Documents/СчетНаОплатуПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПоставщика</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СчетаНал</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыПроектов</xr:Item>
				<xr:Item>AccumulationRegister.БДДС</xr:Item>
				<xr:Item>AccumulationRegister.ЛимитыНаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.СчетаПоставщиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущиеВизирующие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущиеВизирующие1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза_Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Визы_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетНаОплатуПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКоммисии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетнаяСхемаВизирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСпецификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ПроцентФинАгента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ДатаВозвратаФинАгента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Визы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Виза_Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Визы_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекущиеВизирующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредварительныеВизы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Утверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУтверждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/Визы_Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Визы_Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВизировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженаВКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплаченоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСКомментариями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденПоСхеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноСКомментарием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/СчетНаОплатуПоставщика/Ext/ManagerModule.bsl
Функция Виза_ДокументДоступен_НовыеСостояния(пПараметры, пРезультат = Неопределено, пДопы = Неопределено)   Экспорт 
	
	Если ТипЗнч(пПараметры) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") тогда 
		
		лЗапрос = Новый Запрос();
		лЗапрос.Текст = "ВЫБРАТЬ
		                |	Т1.Автор,
		                |	Т1.Ответственный,
		                |	Т1.Ссылка,
		                |	Т1.Виза_Состояние
		                |ИЗ
		                |	Документ.СчетНаОплатуПоставщика КАК Т1
		                |ГДЕ
		                |	Т1.Ссылка = &Ссылка
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	Т2.Ссылка,
		                |	Т2.НомерСтроки,
		                |	Т2.Пользователь
		                |ИЗ
		                |	Документ.СчетНаОплатуПоставщика.ТекущиеВизирующие КАК Т2
		                |ГДЕ
		                |	Т2.Ссылка = &Ссылка
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	Т_ПредварительныеВизы.Ссылка,
		                |	Т_ПредварительныеВизы.НомерСтроки,
		                |	Т_ПредварительныеВизы.Пользователь,
		                |	Т_ПредварительныеВизы.Утверждено,
		                |	Т_ПредварительныеВизы.ДатаУтверждения,
		                |	Т_ПредварительныеВизы.Роли
		                |ИЗ
		                |	Документ.СчетНаОплатуПоставщика.ПредварительныеВизы КАК Т_ПредварительныеВизы
		                |ГДЕ
		                |	Т_ПредварительныеВизы.Ссылка = &Ссылка";
		лЗапрос.УстановитьПараметр("Ссылка", пПараметры);
		
		лРезультат = лЗапрос.ВыполнитьПакет();
		лПараметры = Новый  Структура("Автор, Ответственный, Ссылка, ТекущиеВизирующие, Виза_Состояние, ПредварительныеВизы ");
		ЗаполнитьЗначенияСвойств(лПараметры, лРезультат[0].Выгрузить()[0]);
		лПараметры.ТекущиеВизирующие 	= лРезультат[1].Выгрузить();
		лПараметры.ПредварительныеВизы	= лРезультат[2].Выгрузить();
	Иначе
		лПараметры = пПараметры;
	КонецЕсли;
	
	лТекПользователь 			= Неопределено;
	лРольДоступна_ПолныеПрава 	= Истина;	
	Если НЕ пДопы = Неопределено Тогда 
		пДопы.Свойство("ТекущийПользователь", 		лТекПользователь);
		пДопы.Свойство("РольДоступна_ПолныеПрава", 	лРольДоступна_ПолныеПрава);
	Иначе
		лТекПользователь 			= Пользователи.ТекущийПользователь();
		лРольДоступна_ПолныеПрава 	= РольДоступна("ПолныеПрава");
	КонецЕсли;

	
	лДоступнаФорма 		= Ложь;
	лТекСостояние 		= ?( ЗначениеЗаполнено(лПараметры.Виза_Состояние), лПараметры.Виза_Состояние, Перечисления.Визы_Состояния.Черновик);
	лПредварительныеВизы= лПараметры.ПредварительныеВизы;
	лДоступныеСостояния = Новый Массив();
	лЭтоАвтор 			= лПараметры.Ответственный = лТекПользователь ИЛИ лПараметры.Автор = лТекПользователь или НЕ ЗначениеЗаполнено( лПараметры.Ссылка );   
	
	Если 		НЕ ЗначениеЗаполнено(лПараметры.Ссылка) Тогда 
		лДоступнаФорма 	= Истина;
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Утвержден);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденСКомментариями);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденПоСхеме);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Черновик);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Анулировано);
		
	ИначеЕсли	лТекСостояние = Перечисления.Визы_Состояния.Черновик 
		ИЛИ		лТекСостояние = Перечисления.Визы_Состояния.Анулировано
		ИЛИ		лТекСостояние = Перечисления.Визы_Состояния.Отклонено Тогда 
		
		лДоступнаФорма	= лЭтоАвтор ИЛИ лРольДоступна_ПолныеПрава;
		
		Если лЭтоАвтор ИЛИ лРольДоступна_ПолныеПрава тогда   
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Утвержден);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденСКомментариями);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденПоСхеме);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Черновик);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Анулировано);
		КонецЕсли;
		
	ИначеЕсли 	лТекСостояние = Перечисления.Визы_Состояния.НаВизировании Тогда 
		
		Если	лРольДоступна_ПолныеПрава 
			ИЛИ НЕ лПараметры.ТекущиеВизирующие.НайтиСтроки( Новый Структура("Пользователь",  лТекПользователь) ).Количество() = 0 тогда 
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Утвержден);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденСКомментариями);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
		КонецЕсли;
	
		Если лЭтоАвтор ИЛИ лРольДоступна_ПолныеПрава тогда   
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Черновик);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Анулировано);
		КонецЕсли;
		
		//Сава 2016/08 - предварительная виза
		Если НЕ лПредварительныеВизы.НайтиСтроки(Новый Структура("Пользователь", лТекПользователь) ).Количество() = 0  тогда   
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.ПустаяСсылка());//Предварительная виза
		КонецЕсли;
		
		
	ИначеЕсли   лТекСостояние = Перечисления.Визы_Состояния.Утвержден Тогда 
		
		Если	лРольДоступна_ПолныеПрава тогда
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
		КонецЕсли;
			
	КонецЕсли;
		
	//Сава: 2016/05/18 переводим из массива в структуру 
	лСоотвИмен = Новый Соответствие();
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Анулировано , 	"Анулировать");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.НаВизировании, "На визирование");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Отклонено , 	"Оклонить");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Утвержден, 	"Утвердить");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.УтвержденПоСхеме, "Утвердить (по схеме)");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.УтвержденСКомментариями, 	"Утвердить (с комментариями)");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Черновик, 		"Черновик");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.ОтложеноСКомментарием, "Отложено (с комментарием)");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.ПустаяСсылка(),"ОТЛОЖЕНО (виза)");
	лСписОК = Новый СписокЗначений();
	
	Для Каждого лСтрока Из лДоступныеСостояния Цикл 
		лВремПерем = лСоотвИмен.Получить(лСтрока);
	  	лСписОК.Добавить(лСтрока, ?(лВремПерем = Неопределено, Строка(лСтрока),  лВремПерем) );
	КонецЦикла;
	
	
	пРезультат = ?( ТипЗнч(пРезультат) = Тип("Структура"), пРезультат, Новый Структура);
	пРезультат.Вставить("ФормаДоступна",	лДоступнаФорма);
	//пРезультат.Вставить("Состояния", 		лДоступныеСостояния);
	пРезультат.Вставить("Состояния", 		лСписОК);
	
	пРезультат.Вставить("СкипатьЭлФормы", 	"");
	Если  	лРольДоступна_ПолныеПрава 
		ИЛИ НЕ лПараметры.ТекущиеВизирующие.НайтиСтроки( Новый Структура("Пользователь",  лТекПользователь) ).Количество() = 0 тогда 
		//**пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий");
		//zhukoff++ Временно разрешаем менять статью
		//пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств");
		пРезультат.Вставить("СкипатьЭлФормы", 	"ПриоритетнаяСхемаВизирования,СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств, Визы, ТекущиеВизирующие, ПредварительныеВизы");
	КонецЕсли;

	//++ Бахтишаев А.Э. , 26/09/16 06:29,290
	Если РольДоступна("ДоступностьСчетовПоОрганизациям")
		И лТекСостояние = Перечисления.Визы_Состояния.НаВизировании
		И ТипЗнч(пПараметры) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		Если пПараметры.Подразделение.ДетализацияДоСекций Тогда
			пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств, Визы, ТекущиеВизирующие, ПредварительныеВизы, Организация, Секция");
		Иначе
			пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств, Визы, ТекущиеВизирующие, ПредварительныеВизы, Организация");
		КонецЕсли;
	КонецЕсли;		
	//-- Бахтишаев А.Э. , 26/09/16 06:29
	
	//++ Павел Чистяков 11.10.2016 15:49:12 №316
	//Сава по просьбе ГлБуха - запечатываем
	//Если РольДоступна(Метаданные.Роли.Казначей)
	//	И ТипЗнч(пПараметры) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
	//	Если пРезультат.Свойство("СкипатьЭлФормы") Тогда
	//		пРезультат.СкипатьЭлФормы = пРезультат.СкипатьЭлФормы + ", Контрагент, СчетКонтрагента";
	//	Иначе
	//		пРезультат.Вставить("СкипатьЭлФормы","Контрагент, СчетКонтрагента");
	//	КонецЕсли;
	//КонецЕсли; 
	
	//-- Павел Чистяков 11.10.2016 15:49:55 
	
	Возврат лДоступнаФорма
		ИЛИ ( НЕ 	лТекСостояние = Перечисления.Визы_Состояния.Утвержден И лРольДоступна_ПолныеПрава )  
		ИЛИ  РольДоступна("СчетПокупателя_ИзменениеУтвержденных") 
		ИЛИ ( 		лТекСостояние = Перечисления.Визы_Состояния.Утвержден И РольДоступна("СчетПокупателя_ИзменениеУтвержденных") )  ;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Процедура ОбновитьСтрокуСчетаОснования(Объект, Строка) Экспорт
	
	Если Объект.СтатьяДвиженияДенежныхСредств=Константы.СтатьяКомисияНал.Получить() Тогда
		Строка.Сумма = Строка.Счет.СуммаКоммисии;
	Иначе
		Строка.Сумма = Строка.Счет.СуммаДокумента;
	КонецЕсли;
	Объект.СуммаДокумента = Объект.СчетаОснования.Итог("Сумма");
	
КонецПроцедуры
